In [1]:
import os

PATH = os.path.join('datasets')

In [2]:
import pandas as pd

def load_data(filename, path=PATH):
    csv_path = os.path.join(path, filename)
    return pd.read_csv(csv_path)

def percent(data):
    total = data.isnull().sum().sort_values(ascending=False)
    percent_1 = data.isnull().sum()/data.isnull().count()*100
    percent_2 = (round(percent_1, 1)).sort_values(ascending=False)
    missing_data = pd.concat([total, percent_2], axis=1, keys=['Total', '%'])
    return missing_data.head()

In [3]:
customer = load_data("FINAL_CUSTOMER_DATATHON.csv")
customer_rel = load_data("FINAL_CUSTOMER_RELATED_TABLE_FOR_DATATHON.csv")
sales = load_data("FINAL_SALES_FILE_DATATHON.csv")
sifir = load_data("FINAL_SIFIR_ARAC_ALANLAR_DATATHON.csv")
vehicle = load_data("FINAL_VEHICLE_TABLE_DATATHON.csv")
servis = load_data("MASK_SERVIS_BAKIM_DATATHON_FINAL.csv")

# Customer Data

In [4]:
customer.head()

,Unnamed: 0,BASE_CUSTOMER_ID,CUSTOMER_ID,GENDER,GENDER_ID,MARITAL_STATUS,MARITAL_STATUS_ID,BIRTH_DATE,FK_ADDRESS_COMMUNICATION_CITY,OCCUPATION
0,0,158891.0,1747700.0,Erkek,100.0,NaN,0.0,NaN,NaN,NaN
1,1,169233.0,1710561.0,Erkek,100.0,Evli,101.0,1962.0,Erzurum,Öğretmen / Eğitmen
2,2,30887.0,1043923.0,Erkek,100.0,Evli,101.0,1971.0,İstanbul,Esnaf
3,3,38013.0,1101926.0,Erkek,100.0,NaN,0.0,NaN,Manisa,NaN
4,4,157091.0,1819787.0,Kadın,101.0,NaN,0.0,NaN,Ankara,NaN

In [5]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 849919 entries, 0 to 849918
Data columns (total 10 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   Unnamed: 0                     849919 non-null  object
 1   BASE_CUSTOMER_ID               849215 non-null  float64
 2   CUSTOMER_ID                    849215 non-null  float64
 3   GENDER                         849212 non-null  object
 4   GENDER_ID                      849215 non-null  float64
 5   MARITAL_STATUS                 620104 non-null  object
 6   MARITAL_STATUS_ID              849215 non-null  float64
 7   BIRTH_DATE                     644744 non-null  float64
 8   FK_ADDRESS_COMMUNICATION_CITY  729651 non-null  object
 9   OCCUPATION                     380348 non-null  object
dtypes: float64(5), object(5)
memory usage: 64.8+ MB

In [6]:
percent(customer)

                                Total     %
OCCUPATION                     469571  55.2
MARITAL_STATUS                 229815  27.0
BIRTH_DATE                     205175  24.1
FK_ADDRESS_COMMUNICATION_CITY  120268  14.2
GENDER                            707   0.1

In [7]:
customer.columns.values

array(['Unnamed: 0', 'BASE_CUSTOMER_ID', 'CUSTOMER_ID', 'GENDER',
       'GENDER_ID', 'MARITAL_STATUS', 'MARITAL_STATUS_ID', 'BIRTH_DATE',
       'FK_ADDRESS_COMMUNICATION_CITY', 'OCCUPATION'], dtype=object)

# Customer Related Data

In [8]:
customer_rel.head()

,Unnamed: 0,BASE_CUSTOMER_ID,VEHICLE_ID,START_DATE,END_DATE,FK_RELATION_STATUS_ID,FK_RELATION_STATUS_EXPLANATION
0,0,189537,5321560,2018-07-24,2019-07-03,2,Pasif Ruhsat Sahibi
1,1,110802,5329278,2019-07-16,NaN,1,Aktif Ruhsat Sahibi
2,2,160615,5329282,2019-09-12,NaN,1,Aktif Ruhsat Sahibi
3,3,115664,5328513,2019-02-25,NaN,1,Aktif Ruhsat Sahibi
4,4,81061,5322264,2018-04-16,NaN,1,Aktif Ruhsat Sahibi

In [9]:
customer_rel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 374879 entries, 0 to 374878
Data columns (total 7 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Unnamed: 0                      374879 non-null  int64
 1   BASE_CUSTOMER_ID                374879 non-null  int64
 2   VEHICLE_ID                      374879 non-null  int64
 3   START_DATE                      374879 non-null  object
 4   END_DATE                        159757 non-null  object
 5   FK_RELATION_STATUS_ID           374879 non-null  int64
 6   FK_RELATION_STATUS_EXPLANATION  374879 non-null  object
dtypes: int64(4), object(3)
memory usage: 20.0+ MB

In [10]:
percent(customer_rel)

                   Total     %
END_DATE          215122  57.4
Unnamed: 0             0   0.0
BASE_CUSTOMER_ID       0   0.0
VEHICLE_ID             0   0.0
START_DATE             0   0.0

In [11]:
customer_rel.columns.values

array(['Unnamed: 0', 'BASE_CUSTOMER_ID', 'VEHICLE_ID', 'START_DATE',
       'END_DATE', 'FK_RELATION_STATUS_ID',
       'FK_RELATION_STATUS_EXPLANATION'], dtype=object)

# Sales Data

In [12]:
sales.head()

,Unnamed: 0,CUSTOMER_ID,SALESFILE_ID,SF_CREATE_DATE,STATUS,REQ_BRAND_CODE,REQ_TOPMODEL_CODE
0,0,1712792,7274467.0,2017-11-17 12:15:39,101,Y,9231.0
1,1,1149729,4839430.0,2015-11-11 17:03:28,102,K,9184.0
2,2,1697993,4847398.0,2015-11-14 11:15:51,102,Y,9231.0
3,3,1680258,3817349.0,2014-12-23 17:26:09,105,Y,9362.0
4,4,1244973,8079074.0,2018-08-28 12:55:04,101,K,9901.0

In [13]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397526 entries, 0 to 397525
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Unnamed: 0         397526 non-null  int64
 1   CUSTOMER_ID        397526 non-null  int64
 2   SALESFILE_ID       397526 non-null  float64
 3   SF_CREATE_DATE     397526 non-null  object
 4   STATUS             397526 non-null  int64
 5   REQ_BRAND_CODE     397526 non-null  object
 6   REQ_TOPMODEL_CODE  397237 non-null  float64
dtypes: float64(2), int64(3), object(2)
memory usage: 21.2+ MB

In [14]:
percent(sales)

                   Total    %
REQ_TOPMODEL_CODE    289  0.1
Unnamed: 0             0  0.0
CUSTOMER_ID            0  0.0
SALESFILE_ID           0  0.0
SF_CREATE_DATE         0  0.0

In [15]:
sales.columns.values

array(['Unnamed: 0', 'CUSTOMER_ID', 'SALESFILE_ID', 'SF_CREATE_DATE',
       'STATUS', 'REQ_BRAND_CODE', 'REQ_TOPMODEL_CODE'], dtype=object)

# Sıfır Araç Data

In [16]:
sifir.head()

   Unnamed: 0  VEHICLE_ID  CUSTOMER_ID          CREATE_DATE
0           0     5015193      1063740  2005-01-01 19:08:33
1           1     5110231      1155678  2005-09-29 17:16:15
2           2     5290356      1737831  2016-04-29 13:12:10
3           3     5344576      1841362  2021-03-16 13:39:01
4           4     5094010      1066916  2005-04-20 09:51:19

In [17]:
sifir.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169525 entries, 0 to 169524
Data columns (total 4 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Unnamed: 0   169525 non-null  int64
 1   VEHICLE_ID   169525 non-null  int64
 2   CUSTOMER_ID  169525 non-null  int64
 3   CREATE_DATE  169525 non-null  object
dtypes: int64(3), object(1)
memory usage: 5.2+ MB

In [18]:
percent(sifir)

             Total    %
Unnamed: 0       0  0.0
VEHICLE_ID       0  0.0
CUSTOMER_ID      0  0.0
CREATE_DATE      0  0.0

In [19]:
sifir.columns.values

array(['Unnamed: 0', 'VEHICLE_ID', 'CUSTOMER_ID', 'CREATE_DATE'],
      dtype=object)

# Vehicle

In [20]:
vehicle.head()

,Unnamed: 0,VEHICLE_ID,TRAFFIC_DATE,BRAND_CODE,BASEMODEL_CODE,TOPMODEL_CODE,MOTOR_GAS_TYPE,GEAR_BOX_TYPE
0,0,5317713,2017-12-07,Z,13398,9349,Benzin,Manuel
1,1,5259212,2014-12-09,X,15694,9524,Dizel,Otomatik (DSG)
2,2,5110414,2005-12-12,Y,11183,9118,Kurşunsuz Benzin,Otomatik
3,3,5101263,2005-08-23,X,15039,9495,Benzin,Manuel
4,4,5053909,2003-04-09,Y,12255,9219,NaN,NaN

In [21]:
vehicle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 345092 entries, 0 to 345091
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Unnamed: 0      345092 non-null  int64
 1   VEHICLE_ID      345092 non-null  int64
 2   TRAFFIC_DATE    344226 non-null  object
 3   BRAND_CODE      345092 non-null  object
 4   BASEMODEL_CODE  345092 non-null  int64
 5   TOPMODEL_CODE   345092 non-null  int64
 6   MOTOR_GAS_TYPE  272646 non-null  object
 7   GEAR_BOX_TYPE   261077 non-null  object
dtypes: int64(4), object(4)
memory usage: 21.1+ MB

In [22]:
percent(vehicle)

                Total     %
GEAR_BOX_TYPE   84015  24.3
MOTOR_GAS_TYPE  72446  21.0
TRAFFIC_DATE      866   0.3
Unnamed: 0          0   0.0
VEHICLE_ID          0   0.0

In [23]:
vehicle.columns.values

array(['Unnamed: 0', 'VEHICLE_ID', 'TRAFFIC_DATE', 'BRAND_CODE',
       'BASEMODEL_CODE', 'TOPMODEL_CODE', 'MOTOR_GAS_TYPE',
       'GEAR_BOX_TYPE'], dtype=object)

# Servis

In [24]:
servis.head()

,Unnamed: 0,CREATE_DATE,IS_MAINTENANCE,VEHICLE_ID,TOTAL_AMOUNT_TL
0,0,2010-12-29 10:50:56,1,5000001,192.0
1,1,2013-08-21 10:34:21,1,5000001,267.0
2,2,2015-11-30 10:55:00,1,5000001,1747.0
3,3,2015-12-09 13:38:49,0,5000001,465.0
4,4,2017-11-23 09:53:22,1,5000001,549.0

In [25]:
servis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1041000 entries, 0 to 1040999
Data columns (total 5 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   Unnamed: 0       1041000 non-null  int64
 1   CREATE_DATE      1041000 non-null  object
 2   IS_MAINTENANCE   1041000 non-null  int64
 3   VEHICLE_ID       1041000 non-null  int64
 4   TOTAL_AMOUNT_TL  965596 non-null   float64
dtypes: float64(1), int64(3), object(1)
memory usage: 39.7+ MB

In [26]:
percent(servis)

                 Total    %
TOTAL_AMOUNT_TL  75404  7.2
Unnamed: 0           0  0.0
CREATE_DATE          0  0.0
IS_MAINTENANCE       0  0.0
VEHICLE_ID           0  0.0

In [27]:
servis.columns.values

array(['Unnamed: 0', 'CREATE_DATE', 'IS_MAINTENANCE', 'VEHICLE_ID',
       'TOTAL_AMOUNT_TL'], dtype=object)

In [29]:
customer_rel.describe()

          Unnamed: 0  BASE_CUSTOMER_ID    VEHICLE_ID  FK_RELATION_STATUS_ID
count  374879.000000     374879.000000  3.748790e+05          374879.000000
mean   187439.000000     100153.756567  5.172021e+06               1.426156
std    108218.390119      56049.517641  9.910113e+04               0.494518
min         0.000000          1.000000  5.000001e+06               1.000000
25%     93719.500000      51807.000000  5.086596e+06               1.000000
50%    187439.000000     102932.000000  5.171862e+06               1.000000
75%    281158.500000     148477.000000  5.257520e+06               2.000000
max    374878.000000     196564.000000  5.345092e+06               2.000000